{
  "header": {
    "home":"Главная",
    "aboutMe": "Обо мне",
    "skills": "Навыки",
    "projects": "Проекты"
  },
  "landingPage": {
    "frontendDeveloper": "Фронтенд разработчик",
    "basedInBerlin": "в Берлине",
    "availableForRemoteWork": "Доступна для удаленной работы",
    "contactMe": "Напишите мне",
    "checkMyWork": "Проекты"
  },
  "aboutMe": {
    "whoIAm": "Кто я",
    "aboutMe": "Обо мне",
    "introduction": "Меня зовут Ванесса Закс, я Фронтенд-разработчик из Берлина, специализируюсь на HTML, CSS, JavaScript и Angular. Моя страсть заключается в создании визуально привлекательных и функциональных пользовательских интерфейсов, которые улучшают пользовательский опыт. Я постоянно учусь и слежу за новыми трендами в веб-разработке.",
    "moreAboutMe": "С фокусом на user-centered design, я стремлюсь создавать интуитивные, адаптивные и вовлекающие веб-приложения. Мне нравится работать в кросс-функциональных командах, превращая сложные идеи в элегантные решения. Независимо от того, разрабатываю ли я новый сайт или улучшаю существующую платформу, я нацелена на высокие результаты."
  },
  "skills": {
    "technologies": "Технологии",
    "skillSet": "Набор навыков",
    "frontendTechnologies": "Фронтенд технологии",
    "frontendTechnologiesDescription": "Опыт в HTML, CSS и JavaScript с сильной основой в адаптивном дизайне.",
    "frameworksLibraries": "Фреймворки и библиотеки",
    "frameworksLibrariesDescription": "Опыт работы с Angular, Bootstrap и Material Design для создания современных и удобных приложений.",
    "developmentTools": "Инструменты разработки",
    "developmentToolsDescription": "Знание Git для контроля версий, Scrum для управления проектами и Firebase для интеграции бэкенда.",
    "apis": "API",
    "apisDescription": "Умение интегрировать и разрабатывать RESTful APIs для бесшовной передачи данных.",
    "letsTalk": "Давайте поговорим"
  },
  "portfolio": {
    "portfolio": "Портфолио",
    "featuredProjects": "Проекты",
    "subline": "Изучите подборку моих работ здесь — взаимодействуйте с проектами, чтобы увидеть мои навыки в действии.",
    "whatIsThisProject": "О чем этот проект?",
    "nextProject": "Следующий проект",
    "projects": {
      "join": {
        "index": "01",
        "name": "Join",
        "description": "Task Manager, вдохновленный Kanban-системой. Создавайте и организуйте задачи с помощью drag-and-drop, назначайте пользователей и категории.",
        "technologies": "Технологии",
        "github": "ГитХаб",
        "liveTest": "Тест вживую"
      },
      "elPolloLoco": {
        "index": "02",
        "name": "El Pollo Loco",
        "description": "Игра, разработанная на HTML, CSS и JavaScript, где вам нужно избегать препятствий.",
        "technologies": "Технологии",
        "github": "ГитХаб",
        "liveTest": "Тест вживую"
      }
    }
  },
  "references": {
    "heading": "Что обо мне говорят мои коллеги",
    "reference1": {
      "text": "Работать с Ванессой над нашим программным проектом было удовольствием. Ее чувство юмора и легкий характер создали позитивную атмосферу в команде. Особенно впечатлила ее способность сохранять расслабленность при выполнении качественной работы.",
      "name": "П. Нельсен",
      "jobTitle": "Командный партнер"
    },
    "reference2": {
      "text": "Ванесса всегда демонстрировала высокий уровень вовлеченности и экспертизы в работе. Ее командный дух сделал ее ценным членом нашей команды. Рекомендую Ванессу.",
      "name": "Р. Лохшмидт",
      "jobTitle": "Командный партнер"
    },
    "nextReference": {
      "text": "Следующий отзыв",
      "name": "Будущий участник",
      "jobTitle": ""
    }
  },
  "contact": {
    "contactMe": "Свяжитесь со мной",
    "letsWork": "Давайте поработаем",
    "together": "вместе",
    "gotProblemToSolve": "Есть проблема, которую нужно решить?",
    "contactFormIntro": "Свяжитесь со мной через эту форму. Мне интересно узнать ваши идеи и внести вклад в ваши проекты.",
    "needFrontendDeveloper": "Нужен Фронтенд-разработчик?",
    "letsTalk": "Давайте обсудим!",
    "nameLabel": "Как вас зовут?",
    "namePlaceholder": "Ваше имя здесь",
    "nameError": "Ой! Похоже, ваше имя отсутствует.",
    "emailLabel": "Какой у вас email?",
    "emailPlaceholder": "вашemail@email.com",
    "emailError": "Ой! Требуется ваш email.",
    "messageLabel": "Как я могу вам помочь?",
    "messagePlaceholder": "Привет, Ванесса, меня интересует...",
    "messageError": "Что вам нужно разработать?",
    "privacyLabel1": "Я прочитал ",
     "privacyLabel2":"политику конфиденциальности",
     "privacyLabel3": "и согласен с обработкой моих данных.",
    "privacyError": "Необходимо принять политику конфиденциальности.",
    "sayHello": "Сказать привет",
    "messageSent": "Спасибо! Ваше сообщение отправлено."
  },
  "footer": {
    "webDeveloper": "Веб-разработчик",
    "location": "Берлин, Германия",
    "copyright": "© Ванесса Закс 2024",
    "github": "ГитХаб",
    "email": "Электронная почта",
    "imprint": "Импрессум"
  },
  "imprint": {
    "imprintTitle": "Импрессум",
    "personName": "Ванесса Закс",
    "address":" Гертруд-Кольмар-Штр. 5",
    "zip": "10117 Берлин",
    "contactTitle": "Контакт",
    "email": "Электронная почта"
  },
    "privacy": {
      "title": "Политика конфиденциальности",
      "preamble": "Преамбула",
      "preambleText": "В данном уведомлении о конфиденциальности мы хотим проинформировать вас о том, какие виды ваших персональных данных (далее также именуемых «данные») мы обрабатываем, с какой целью и в каком объеме. Политика конфиденциальности распространяется на все случаи обработки персональных данных, которые мы осуществляем как в рамках оказания наших услуг, так и на наших веб-сайтах, в мобильных приложениях, а также на внешних онлайн-платформах, таких как наши профили в социальных сетях (далее именуемых «онлайн-предложения»).",
      "genderNeutral": "Используемые термины не являются гендерно специфичными.",
      "lastUpdated": "По состоянию на: 16 сентября 2024 года",
      "contentOverview": "Содержание",
      "responsible": {
        "title": "Ответственное лицо",
        "name": "Ванесса Сакс",
        "street": "Гертруд-Кольмар-Штрассе 5",
        "postalCode": "10117",
        "city": "Берлин",
        "country": "Германия"
      },
      "email": {
        "label": "Адрес электронной почты:"
      },
      "processingOverview": "Обзор обработки",
      "processingOverviewText": "Следующий обзор резюмирует виды обрабатываемых данных и цели их обработки, а также указывает на категории затронутых лиц.",
      "dataTypes": {
        "title": "Виды обрабатываемых данных",
        "item1": "Данные учётных записей",
        "item2": "Контактные данные",
        "item3": "Содержательные данные",
        "item4": "Данные о пользовании",
        "item5": "Мета-, коммуникационные и процедурные данные",
        "item6": "Протокольные данные"
      },
      "dataSubjects": {
        "title": "Категории субъектов данных",
        "item1": "Партнёры по коммуникации",
        "item2": "Пользователи"
      },
      "purposes": {
        "title": "Цели обработки",
        "item1": "Коммуникация",
        "item2": "Меры безопасности",
        "item3": "Организационные и административные процедуры",
        "item4": "Обратная связь",
        "item5": "Предоставление нашего онлайн-предложения и удобство пользователей",
        "item6": "Информационно-техническая инфраструктура"
      },
      "legalBasis": {
        "title": "Юридические основания",
        "text": "Основные правовые основания по GDPR: Далее приведён обзор правовых оснований GDPR, на основе которых мы обрабатываем персональные данные. Обратите внимание, что кроме положений GDPR могут действовать национальные требования в области защиты данных в вашей стране или стране нашего местонахождения. Если в отдельных случаях применяются более конкретные правовые основания, мы сообщаем вам об этом в уведомлении о конфиденциальности.",
        "contract": {
          "label": "Выполнение договора и преддоговорные запросы (ст. 6 п. 1 п. b) GDPR)",
          "description": "Обработка необходима для выполнения договора, стороной которого является субъект данных, или для проведения мероприятий, предпринятых по запросу субъекта данных до заключения договора."
        },
        "legitimateInterest": {
          "label": "Законные интересы (ст. 6 п. 1 п. f) GDPR)",
          "description": "Обработка необходима для защиты законных интересов контролёра или третьей стороны, если интересы, основные права и свободы субъекта данных, требующие защиты персональных данных, не имеют приоритета."
        },
        "nationalLaws": {
          "title": "Национальные правила защиты данных в Германии",
          "description": "В дополнение к положениям GDPR применяются национальные правила защиты данных в Германии. Это включает в себя, в частности, Закон о защите данных Германии (BDSG), который содержит специальные правила о праве на информацию, праве на удаление, праве на возражение, обработке особых категорий персональных данных, обработке в других целях, а также передаче и автоматизированном принятии решений в отдельных случаях, включая профилирование. Кроме того, могут применяться законы о защите данных отдельных федеральных земель."
        },
        "swissLaw": {
          "title": "Уведомление о применении GDPR и Швейцарского закона о защите данных",
          "description": "Данные уведомления о защите данных предназначены как для информирования в соответствии с Швейцарским законом о защите данных (DSG), так и в соответствии с Общим регламентом по защите данных (GDPR). По этой причине, обратите внимание, что для большей применимости и понимания используются термины GDPR. В частности, используются термины «обработка» персональных данных, «законный интерес» и «особые категории данных» вместо терминов, используемых в DSG, таких как «обработка» персональных данных, «превалирующий интерес» и «особо охраняемые персональные данные». Юридическое значение терминов, однако, продолжает определяться в рамках применения DSG."
        }
      },
      "securityMeasures": {
        "title": "Меры безопасности",
        "text1": "Мы принимаем соответствующие технические и организационные меры в соответствии с правовыми требованиями, с учётом состояния техники, стоимости внедрения, характера, объёма, обстоятельств и целей обработки, а также различных вероятностей наступления и степени угрозы правам и свободам физических лиц, чтобы обеспечить адекватный уровень защиты от рисков.",
        "text2": "Меры включают, в частности, обеспечение конфиденциальности, целостности и доступности данных путём контроля физического и электронного доступа к данным, а также доступа к данным, ввода, передачи, обеспечения доступности и разделения данных. Мы также внедрили процедуры, гарантирующие соблюдение прав субъектов данных, удаление данных и реагирование на угрозы безопасности данных. Кроме того, мы учитываем защиту персональных данных уже на этапе разработки или выбора аппаратного обеспечения, программного обеспечения и процедур в соответствии с принципом защиты данных с помощью технологического проектирования и через настройки по умолчанию, обеспечивающие конфиденциальность."
      },
      "dataTransfers": {
        "title": "Передача персональных данных",
        "text": "В рамках обработки персональных данных может возникнуть необходимость передачи этих данных другим лицам, компаниям, юридически независимым организациям или раскрытия их им. Получателями этих данных могут быть, например, поставщики ИТ-услуг или провайдеры услуг и контента, интегрированные в веб-сайт. В таких случаях мы соблюдаем правовые требования и заключаем соответствующие контракты или соглашения с получателями ваших данных, которые обеспечивают защиту ваших данных."
      },
      "internationalTransfers": {
        "title": "Международные передачи данных",
        "text1": "Обработка данных в третьих странах: Если мы обрабатываем данные в третьей стране (то есть за пределами Европейского Союза (ЕС), Европейского экономического пространства (ЕЭЗ)) или если обработка осуществляется в рамках использования сторонних услуг или раскрытия или передачи данных другим лицам, субъектам или компаниям, это происходит только в соответствии с правовыми требованиями.",
        "text2": "Если уровень защиты данных в третьей стране признан достаточным в соответствии с решением о достаточности (ст. 45 GDPR), это служит основанием для передачи данных. В противном случае передача данных осуществляется только тогда, когда уровень защиты данных обеспечен иным образом, в частности через стандартные договорные положения (ст. 46 п. 2 п. c) GDPR), явное согласие или в случае контрактной или законодательно требуемой передачи (ст. 49 п. 1 GDPR)."
      },
      "dataRetention": {
        "title": "Общая информация о хранении и удалении данных",
        "text1": "Мы удаляем персональные данные, которые мы обрабатываем, в соответствии с правовыми требованиями, как только отзываются предоставленные согласия или больше не существует правовых оснований для обработки. Это касается случаев, когда первоначальная цель обработки перестаёт быть актуальной или данные больше не требуются. Исключения из этого правила существуют, когда законодательные обязательства или особые интересы требуют более длительного хранения или архивирования данных.",
        "text2": "В частности, данные, которые должны храниться по коммерческим или налоговым причинам или чьё хранение необходимо для предъявления правовых претензий или защиты прав других физических или юридических лиц, должны быть должным образом архивированы.",
        "text3": "Наши уведомления о конфиденциальности содержат дополнительную информацию о хранении и удалении данных, которые относятся к конкретным процессам обработки."
      },
      "rights": {
        "title": "Права субъектов данных",
        "text1": "Права субъектов данных в соответствии с GDPR: Как субъект данных, вы имеете различные права в соответствии с GDPR, которые изложены в статьях 15–21 GDPR.",
        "item1": {
          "title": "Право на возражение",
          "description": "Вы имеете право в любое время возражать против обработки персональных данных, которые касаются вас, на основании причин, связанных с вашей конкретной ситуацией, в соответствии со статьёй 6 п. 1 лит. e или f GDPR; это также относится к профилированию на основе этих положений. Если персональные данные, которые касаются вас, обрабатываются в целях прямого маркетинга, вы имеете право в любое время возражать против обработки персональных данных, которые касаются вас, для таких маркетинговых целей; это также относится к профилированию, если оно связано с таким прямым маркетингом."
        },
        "item2": {
          "title": "Право на отзыв согласия",
          "description": "Вы имеете право в любое время отозвать ранее данное согласие."
        },
        "item3": {
          "title": "Право на доступ",
          "description": "Вы имеете право запросить подтверждение того, обрабатываются ли данные, касающиеся вас, и получить информацию об этих данных, а также дополнительную информацию и копию данных в соответствии с правовыми требованиями."
        },
        "item4": {
          "title": "Право на исправление",
          "description": "Вы имеете право, в соответствии с правовыми требованиями, требовать завершения данных, касающихся вас, или исправления неправильных данных, касающихся вас."
        },
        "item5": {
          "title": "Право на удаление и ограничение обработки",
          "description": "В соответствии с правовыми требованиями вы имеете право требовать немедленного удаления данных, касающихся вас, или, альтернативно, требовать ограничения обработки данных в соответствии с правовыми требованиями."
        },
        "item6": {
          "title": "Право на переносимость данных",
          "description": "Вы имеете право получать данные, касающиеся вас, которые вы предоставили нам, в структурированном, широко используемом и машиночитаемом формате или требовать их передачи другому контролёру в соответствии с правовыми требованиями."
        },
        "item7": {
          "title": "Право на подачу жалобы в надзорный орган",
          "description": "Вы имеете право подать жалобу в надзорный орган, не затрагивая другие административные или судебные средства правовой защиты, в частности в государстве-члене вашего обычного проживания, места работы или места предполагаемого нарушения, если вы считаете, что обработка ваших персональных данных нарушает положения GDPR."
        }
      }
    }
  }
  